In [34]:
import pandas as pd

In [35]:
names_1 = pd.read_csv('muslim_names/arabic_names.csv')

In [36]:
names_1.head()

,english_name,arabic_name,gender,origin
0,Aali,عالي,m,Arabic
1,Aaliyah,عالية,f,"Arabic, English (Modern), African American (Mo..."
2,Aamina,آمنة,f,"Arabic, Eastern African, Somali"
3,Aaminah,آمنة,f,Arabic
4,'Aamir,عامر,m,Arabic

In [37]:
names_1.drop(['arabic_name', 'origin', 'gender'] , axis=1, inplace=True)

In [38]:
names_1.head()

  english_name
0         Aali
1      Aaliyah
2       Aamina
3      Aaminah
4       'Aamir

In [39]:
names_1 = names_1.rename(columns={'english_name':'Name'})

In [40]:
names_1.head()

      Name
0     Aali
1  Aaliyah
2   Aamina
3  Aaminah
4   'Aamir

In [41]:
names_2 = pd.read_csv('muslim_names/arabnames.csv')
names_3 = pd.read_csv('muslim_names/females_en.csv')
names_4 = pd.read_csv('muslim_names/males_en.csv')
names_2.drop(['Gender'], axis=1, inplace=True)
names_3.drop(['Gender'], axis=1, inplace=True)
names_4.drop(['Gender'], axis=1, inplace=True)

In [42]:
names_2.head()

    Name
0  aaban
1  aabid
2  aadil
3  aahil
4  aalam

In [43]:
names_3.head()

      Name
0  aabidah
1  aabirah
2   aabish
3    aadab
4   aadila

In [44]:
names_4.tail()

            Name
2061    zulfaqar
2062    zulfiqar
2063  zulqarnain
2064     zunnoon
2065        zuti

In [45]:
aggregated_names = pd.concat([names_2, names_3], ignore_index=True)

In [46]:
aggregated_names

          Name
0        aaban
1        aabid
2        aadil
3        aahil
4        aalam
...        ...
6951  zumurrud
6952    zumzum
6953  zunairah
6954     zynah
6955      zyva

[6956 rows x 1 columns]

In [47]:
aggregated_names = pd.concat([aggregated_names, names_4], ignore_index=True)

In [48]:
aggregated_names

            Name
0          aaban
1          aabid
2          aadil
3          aahil
4          aalam
...          ...
9017    zulfaqar
9018    zulfiqar
9019  zulqarnain
9020     zunnoon
9021        zuti

[9022 rows x 1 columns]

In [49]:
aggregated_names = pd.concat([aggregated_names, names_1], ignore_index=True)

In [50]:
aggregated_names

             Name
0           aaban
1           aabid
2           aadil
3           aahil
4           aalam
...           ...
10213        Guda
10214      Haamid
10215       Habib
10216      Habiba
10217  Habibullah

[10218 rows x 1 columns]

In [51]:
print(aggregated_names.duplicated().sum())

5488

In [52]:
final_df = aggregated_names.drop_duplicates()

In [53]:
print(aggregated_names.duplicated().sum())

5488

In [54]:
print(aggregated_names.isnull().sum())

Name    0
dtype: int64

In [55]:
aggregated_names.head()

    Name
0  aaban
1  aabid
2  aadil
3  aahil
4  aalam

In [56]:
aggregated_names.to_csv("aggregated_muslim_names.csv")

In [57]:
df = pd.read_csv("aggregated_muslim_names.csv")

In [58]:
df

       Unnamed: 0        Name
0               0       aaban
1               1       aabid
2               2       aadil
3               3       aahil
4               4       aalam
...           ...         ...
10213       10213        Guda
10214       10214      Haamid
10215       10215       Habib
10216       10216      Habiba
10217       10217  Habibullah

[10218 rows x 2 columns]

In [59]:
df.drop_duplicates(subset='Name', keep='first', inplace=True)

In [60]:
df

      Unnamed: 0        Name
0              0       aaban
1              1       aabid
2              2       aadil
3              3       aahil
4              4       aalam
...          ...         ...
9316        9316        Guda
9317        9317      Haamid
9318        9318       Habib
9319        9319      Habiba
9320        9320  Habibullah

[4730 rows x 2 columns]

In [61]:
print(df.duplicated().sum())

0

In [62]:
print(df.isnull().sum())

Unnamed: 0    0
Name          0
dtype: int64

In [63]:
df.drop(columns=['Unnamed: 0'], inplace=True)

In [64]:
df.head()

    Name
0  aaban
1  aabid
2  aadil
3  aahil
4  aalam

In [65]:
df.to_csv("muslim_names.csv")

In [67]:
movie_characters_df = pd.read_csv("movie_characters.csv")
movie_characters_df.drop(columns=['Actor'], inplace=True)
movie_characters_df.head()

  Movie Title  Year                 Character
0  Veer Zaara  2004         Veer Pratap Singh
1  Veer Zaara  2004         Zaara Hayaat Khan
2  Veer Zaara  2004          Saamiya Siddiqui
3  Veer Zaara  2004        Mariam Hayaat Khan
4  Veer Zaara  2004  Shabina 'Shabbo' Ibrahim

In [70]:
muslim_name_set = set(df['Name'].str.lower())
movie_muslim_dict = {}

for movie, group in movie_characters_df.groupby('Movie Title'):
    has_muslim = False
    for character in group['Character'].dropna():
        # Split character names by space and special characters, check each part
        name_parts = [part.strip(" '\"") for part in character.split()]
        if any(part.lower() in muslim_name_set for part in name_parts):
            has_muslim = True
            break
    movie_muslim_dict[movie] = "yes" if has_muslim else "no"

In [71]:
movie_muslim_dict

{'3 Idiots': 'yes',
 'Ajab Prem Ki Ghazab Kahani': 'yes',
 'Bol Bachchan': 'yes',
 'Bunty Aur Babli': 'no',
 'Chak De India': 'yes',
 'Dhoom': 'yes',
 'Dhoom 2': 'yes',
 'Don': 'yes',
 'Don 2': 'yes',
 'Ek Tha Tiger': 'yes',
 'Fanaa': 'yes',
 'Jab Tak Hai Jaan': 'yes',
 'Jodhaa Ahkbar': 'yes',
 'Main Hoon Na': 'yes',
 'Mangal Pandey': 'yes',
 'My Name is Khan': 'yes',
 'Om Shanti Om': 'no',
 'Once Upon a Time in Mumbaai': 'yes',
 'Rockstar': 'yes',
 'Sarkar': 'no',
 'Sarkar Raj': 'yes',
 'Taare Zameen Par': 'yes',
 'Tees Maar Khan': 'yes',
 'Thoda Pyaar Thoda Magic': 'yes',
 'Veer Zaara': 'yes',
 'Wanted': 'yes',
 'Zindagi Na Milegi Dobara': 'yes'}